const Interview = () => {

    return(
        <div className="Interview">
            <h2 className="titleName">📰비전 있는 비전공자의 셀프 인터뷰</h2>
            <p className="titleMini">- 저에게 흥미가 생겼다면 읽어주세요!</p>
            <div className="inTxt">
                <div className="inStyle">
                    <h3>재능 보다는 재미</h3>
                    <p>
                        코딩은...재밌습니다. 코드를 짜면 결과물이 직관적으로 도출되는 것도 재밌지만 
                        개인적으로는 중간 중간 <span>오류를 해결하는 과정에서 쾌감</span>이 느껴지는 것 같습니다. 
                        가끔 오류가 생기면 기분이 좋다고 이야기 하면 미친 사람 취급을 받기는 합니다. 
                        하지만 실무자 분들 중에서는 저와 비슷한 성향을 가진 분들이 꽤 있을 거라 생각합니다. <br />
                        취업하게 된다면 비슷한 분들과 <span>옹기종기 모여서 오류를 찾아보고 싶은 로망</span>이 있습니다.
                        (오류나면 “어?” 한마디도 해보고 싶구요.)
                    </p>
                </div>
                <div className="inStyle">
                    <h3>나는 어떤 사람인가?</h3>
                    <p>
                    게으르지만 목표가 있다면 하기 싫은 것도 끝까지 해버리는 <span>“게으른 완벽주의자”</span> 이 말이 딱 맞는 
                    것 같습니다. 
                    내 입에서 귀찮다는 말이 안 나온 적이 한번도 없는 것 같습니다. 만약 <span>목표</span>를 정하지 않고 살았다면 10년 뒤 
                    저는 이 사회에 도태된 삶을 살고 있었을 겁니다. 하지만 저는 불행 중 다행으로 목표를 어떻게 정하는 지, 
                    목표를 정했을 때 커리큘럼을 어떻게 짜야 하는 지 아주 잘 알고 있습니다. 또한 제가 아주 나태한 사람인 것도 
                    알고 있죠. 그래서 목표를 하나 정한다면 목표를 이루기 위해 귀찮다...라는 말 뒤에 <span>그래도 해야지 못해도 
                    해야지...</span> 하는 말을 덧붙이곤 합니다. 정말 신기하게도 이 뒷말을 붙이면 아무리 귀찮은 일이라도 어떻게든 
                    하게 되더라구요.
                    </p>
                </div>
            </div>
            <div className="inTxt">
                <div className="inStyle">
                    <h3>개발자의 필수 능력?</h3>
                    <p>
                        공부하면서 느꼈지만 특히나 개발자는 <span>능동적으로 생각을 하고 창의력을 키우는 노력</span>이 정말
                        중요한 것 같습니다. 이런 부분에서 코딩도 재능이라는 말이 나왔구나 싶구요. 빠르게 변하는
                        IT업계이니만큼 트렌드도 잘 따라가야 하고 항상 <span>열린 마인드</span>를 유지해야겠구나 싶었습니다.
                        그만큼 <span>공부</span>도 멈추면 안 되구요. 웹개발이 점점 발전하는 만큼 <span>자기개발</span>도 놓치지 않도록
                        노력할 겁니다. 취업해서 등 따숩다고 나태해지면 안 됩니다.<br />
                        <span>저는 제 자신이 부끄럽지 않게, 당당할 수 있도록 공부할 겁니다.</span>
                    </p>
                </div>
                <div className="inStyle">
                    <h3>개발자가 된 이후 목표?</h3>
                    <p>
                        아직 개발자가 된다면 세부 목표는 없지만 첫 번째 목표는 대학입니다. 개인 사정으로 상고를 나왔지만
                        고등학교 정보 시간에 배웠던 <span>파이썬</span>이 잊혀지지 않거든요. 제 생애 첫 코딩이었습니다. 이 재미를 잊지 
                        못해 학원까지 다니게 되었으니까요. 물론 개발자는 포트폴리오가 가장 중요하다고 하지만 제 목표는 
                        학사 학위 취득 후 대학원 생활입니다. <br />
                        저는 <span>왜?</span> 라는 질문을 정말 많이 하는데요. 그 질문을 해소할 수 있는 가장 좋은 방법이 <span>공부</span>라고 생각하기 
                        때문입니다.(괜히 자기계발서에 공부에 미쳐라! 하는 제목의 책들이 있는 게 아닐 겁니다...)
                    </p>
                </div>
            </div>
            <div className="inStyle inLast">
                <h3>배우면서 느낀 점은?</h3>
                <p>
                    비전공으로 국비 학원을 다니면서 참 많은 생각을 했습니다. 특히나 프로젝트를 진행하면서 
                    <span>사용자 입장에서는 당연했던 것들이 개발자 입장에서는 큰 고민거리가 될 수 있겠구나 싶었습니다.</span><br /> <br />
                    가령 인스타그램 같은 sns앱을 만든다면 버튼 하나로도 논쟁거리가 충분하죠.<br />
                    홈 화면에 글쓰기 버튼을 삽입을 할 것입니다. 버튼을 하나를 삽입해서 버튼을 클릭하면 피드, 릴스, 스토리를 
                    선택할 수 있는 버튼이 나오고 피드 버튼을 누르면 피드 글쓰기 페이지로 넘어가자! 라는 의견이 있을 것이고<br />
                    아니다 버튼을 따로 만들어서 각각의 버튼을 홈 화면에 배치하자! 라는 의견이 있을 것입니다.<br />
                    실제로 팀 프로젝트 당시 이런 의견을 주고 받았었는데요 왜 클릭을 두 번이나 해야 하냐 그냥 홈화면에 하나씩 
                    넣어! 라는 의견과... 홈화면이 너무 어지러워진다 클릭 두 번이 대수냐! 그냥 하나만 넣어! 하는 의견이 
                    대립했습니다. (결국 저희의 디자인 능력의 한계로 버튼은 한 개만 넣었습니다.)<br /> <br />
                    이렇게 회의하면서 영화 “악마는 프라다를 입는다”가 생각이 났습니다. 극 중에서 비슷한 모양과 색상의 
                    벨트 두 가지 중 어떤 걸 착용할까... 회의하는 장면이 있습니다. 주인공이 그 모습을 보고 별반 다른 게 없는데 
                    왜 저렇게 심각하게 고민하는 지 이해를 못해 비웃는 장면이 있습니다. 저도 어릴 때 봤던 영화라 주인공과 
                    비슷한 생각을 했는데요. 이제와보니 어떤 분야든 저런 <span>사소한 디테일에 대한 집착이 산업의 발전을 야기</span>한다고 
                    몸소 느낀 경험이었습니다.<br /> <br />
                    10년 전 어플의 UI와 현재 어플의 UI의 차이는 발전을 위한 집착이 아니었을까? 생각이 들었습니다. 
                    <span>10년 뒤의 저도 사용자 입장을 200% 고려할 수 있는 개발자가 되었으면 합니다.</span>
                </p>
            </div>
        </div>
    );
};
export default Interview;